<?php

namespace Nurdaulet\FluxWallet\Helpers;

class TextConverterHelper
{

    private $converter = [
        'а' => 'f',    'б' => ',',    'в' => 'd',    'г' => 'u',    'д' => 'l',
        'е' => 't',    'ё' => '`',    'ж' => ';',   'з' => 'p',    'и' => 'b',
        'й' => 'q',    'к' => 'r',    'л' => 'k',    'м' => 'v',    'н' => 'y',
        'о' => 'o',    'п' => 'g',    'р' => 'h',    'с' => 'c',    'т' => 'n',
        'у' => 'e',    'ф' => 'a',    'х' => '[',    'ц' => 'w',    'ч' => 'x',
        'ш' => 'i',   'щ' => 'o',     'ь' => 'm',     'ы' => 's',    'ъ' => ']',
        'э' => '\'',    'ю' => '.',   'я' => 'z',

        'А' => 'F',    'Б' => ',',    'В' => 'D',    'Г' => 'U',    'Д' => 'L',
        'Е' => 'T',    'Ё' => '~',    'Ж' => ':',   'З' => 'P',    'И' => 'B',
        'Й' => 'Q',    'К' => 'R',    'Л' => 'K',    'М' => 'V',    'Н' => 'Y',
        'О' => 'J',    'П' => 'G',    'Р' => 'H',    'С' => 'C',    'Т' => 'N',
        'У' => 'E',    'Ф' => 'A',    'Х' => '{',    'Ц' => 'W',    'Ч' => 'X',
        'Ш' => 'I',   'Щ' => 'O',  'Ь' => '<',     'Ы' => 'S',    'Ъ' => '}',
        'Э' => '\'',    'Ю' => '>',   'Я' => 'Z',
    ];

    public function convertToTranslator($string)
    {
        return strtr($string, $this->converter);

    }

    public static function translate(string $s)
    {
        $s = strip_tags($s); // убираем HTML-теги
        $s = function_exists('mb_strtolower') ? mb_strtolower($s) : strtolower($s); // переводим строку в нижний регистр (иногда надо задать локаль)
        $s = strtr($s, array(
            'а' => 'a',
            'б' => 'b',
            'в' => 'v',
            'г' => 'g',
            'д' => 'd',
            'е' => 'e',
            'ё' => 'e',
            'ж' => 'j',
            'з' => 'z',
            'и' => 'i',
            'й' => 'y',
            'к' => 'k',
            'л' => 'l',
            'м' => 'm',
            'н' => 'n',
            'о' => 'o',
            'п' => 'p',
            'р' => 'r',
            'с' => 's',
            'т' => 't',
            'у' => 'u',
            'ф' => 'f',
            'х' => 'h',
            'ц' => 'c',
            'ч' => 'ch',
            'ш' => 'sh',
            'щ' => 'shch',
            'ы' => 'y',
            'э' => 'e',
            'ю' => 'yu',
            'я' => 'ya',
            'ъ' => '',
            'ь' => '',
            'ә' => 'a',
            'ғ' => 'g',
            'қ' => 'q',
            'ң' => 'ng',
            'ө' => 'o',
            'ұ' => 'u',
            'ү' => 'u',
            'һ' => 'x',
            'і' => 'i',
        ));
        $s = preg_replace("/[^a-z\d]/i", "-", $s); // очищаем строку от недопустимых символов
        $s = preg_replace("/-+/i", "-", $s); // очищаем повторяющихся дефисов
        $s = preg_replace("/^-+|-+$/i", "", $s); //очищаем  дефисов с начало и с конца
        return $s; // возвращаем результат
    }
}
